#!/bin/bash

# ======================================== shell函数 =======================================

fun1(){
    echo "第一个 函数"
}
fun1

#==============带有return的函数==============
#函数返回值在调用该函数后通过 $? 来获得
fun2(){
    echo "对两个输入数进行相加运算"
    echo "请输入第一个数字"
    read anum
    echo "请输入第二个数字"
    read bnum
    return $(($anum+$bnum))
}
fun2
echo "输入的两个数之和： $?"

#==============函数参数==============
fun3(){
    echo "第一个参数 $1"
    echo "第二个参数 $2"
    echo "第五个参数 $5"
    echo "参数个数： $#"
    echo "作为字符串输出所有参数： $*"
}
fun3 1 2 3 4 5 6 7 8