#!/bin/bash

# ======================================== shell输出命令 =======================================

# # ======== echo =========

echo -e "ok! \n"  # -e开始转义
echo "its a test"

echo -e "ok! \c" # -e开启转义，-c 不换行
echo "its a test2"

# 显示结果定向至文件
echo "it is a test" > ./test.txt

#原样输出字符串
# 单引号无视特殊字符，喂啥吐啥
name="tinn"
echo "$name"
echo '$name'

# 显示命令执行结果
echo `date`

# ======== printf =========

# printf 默认不换行
echo "Hello, Shell"
printf "Hello, Shell\n"
echo "查看是否换行"


#%s %c %d %f 都是格式替代符，％s 输出一个字符串，％d 整型输出，％c 输出一个字符，％f 输出实数，以小数形式输出。
#%-10s 指一个宽度为 10 个字符（- 表示左对齐，没有则表示右对齐），任何字符都会被显示在 10 个字符宽的字符内，如果不足则自动以空格填充，超过也会将内容全部显示出来。
#%-4.2f 指格式化为小数，其中 .2 指保留2位小数。

printf "%-10s %-8s %-4s\n" 姓名 性别 体重kg  
printf "%-10s %-8s %-4.2f\n" 郭靖 男 66.1234
printf "%-10s %-8s %-4.2f\n" 杨过 男 48.6543
printf "%-10s %-8s %-4.2f\n" 郭芙 女 47.9876